app/Controllers/Comments.php

   public function compile($id=0)
   {
      $CommentsModel = new CommentsModel();

      if ($id > 0)
      {
         $comments = $CommentsModel->where('id', $id)->find();
      }
      else
      {
         $comments = $CommentsModel->where('published > ', 0)->findAll();
      }

      $dataz = [];
      $UsersModel = new UsersModel();
      $PostsModel = new PostsModel();

      if  (count($comments) > 0)
      {
         foreach($comments as $val)
         {
            $id = $val['id'];
            $user_id = $val['user_id'];
            $user = $UsersModel->where('id', $user_id)->first();

            $post_id = $val['post_id'];
            $post = $PostsModel->where('id', $post_id)->first();
---
SELECT *
FROM `comments`
WHERE `id` = 8
SELECT *
FROM `comments`
WHERE `published` > 0
SELECT *
FROM `users`
WHERE `id` = '4'
 LIMIT 1
SELECT *
FROM `posts`
WHERE `id` = '310'
 LIMIT 1

   public function add_comment()
   {
      $rules =[
         'user_id' => 'required|integer',
         'post_id' => 'required|integer',
         'content' => 'required'
      ];

      $val = $this->validate($rules);

      if (! $val)
      {
         return $this->respond([
            'status' => 0,
            'message' => Services::validation()->getErrors()
         ], 400);
      }
      else
      {
         $user_id = $this->request->getVar('user_id');

         $UsersModel = new UsersModel();
         $user = $UsersModel->where('id', $user_id)->find();
---
SELECT *
FROM `users`
WHERE `id` = 4

         $post_id = $this->request->getVar('post_id');

         $PostsModel = new PostsModel();
         $post = $PostsModel->where('id', $post_id)->find();
---
SELECT *
FROM `posts`
WHERE `id` = 310

            'date'    => date("Y-m-d")
         ];
         $CommentsModel->insert($data);
         $id = $CommentsModel->insertID;
---
INSERT INTO `comments` (`user_id`, `post_id`, `content`, `date`) VALUES (4, 310, 'Tutakoma', '2023-02-09')