app/Controllers/Posts.php

SELECT *
FROM `posts`
WHERE `published_at` LIKE '%2023-02-09%' ESCAPE '!'
---
   public function index()
   {
      $PostsModel = new PostsModel();

      $date = date("Y-m-d");
      $dataz = $PostsModel->like('published_at', $date)->find();

INSERT INTO `posts` (`author`, `title`, `description`, `url`, `source`, `image`, `category`, `published_at`) VALUES ('Zachary Johnston', 'Grocery Store Bratwurst — Grilled, Tasted Blind, And Ranked For Super Bowl Sunday', 'iStockphoto/UPROXX Grilling brats on Super Bowl Sunday is a national pastime. Here\'s the best pack to buy at your local grocery store.', 'https://uproxx.com/life/best-german-style-bratwurst-ranked/', 'hitfix', NULL, 'general', '2023-02-09T00:13:05+00:00')
SELECT *
FROM `posts`
WHERE `published_at` LIKE '%2023-02-09%' ESCAPE '!'
---

            //echo "<pre>" . print_r($data) . "</pre>";

            $PostsModel->insert($data);
            //echo $PostsModel->getLastQuery() . "<br>";
         }

         $dataz = $PostsModel->like('published_at', $date)->find();