app/Controllers/Users.php

SELECT *
FROM `users`
WHERE `id` = 10
SELECT *
FROM `users`
---
   public function compile($id=0)
   {
      $UsersModel = new UsersModel();

      if ($id > 0)
      {
         $users = $UsersModel->where('id', $id)->find();
      }
      else
      {
         $users = $UsersModel->findAll();

INSERT INTO `users` (`firstname`, `lastname`, `email`, `password`, `dob`) VALUES ('Kassim', 'Collins', 'kascol@gmail.com', 'collins22', '2000-06-02')
INSERT INTO `users` (`username`, `password`, `firstname`, `lastname`, `email`, `dob`) VALUES ('rama', 'rama1234', 'Rama', 'Maabad', 'rama@gmail.com', '01/06/2000')
---
   public function add_user()
   {
      $rules =[
         'firstname' => 'required',
         'lastname' => 'required',
         'email' => 'required|valid_email|is_unique[users.email]',
         'password' => 'required',
         'dob' => 'required'
      ];
      $val = $this->validate($rules);

      if (!$val)
      {
         return $this->respond([
            'status' => 0,
            'message' => Services::validation()->getErrors()
         ], 400);
      }
      else
      {
         $data = [
            'firstname' => $this->request->getVar('firstname'),
            'lastname'  => $this->request->getVar('lastname'),
            'email'     => $this->request->getVar('email'),
            'password'  => $this->request->getVar('password'),
            'dob'       => $this->request->getVar('dob')
         ];

         $UsersModel = new UsersModel();
         $UsersModel->insert($data);
         $id = $UsersModel->insertID;

UPDATE `users` SET `firstname` = 'Kassim', `lastname` = 'Collins', `email` = 'kascol@gmail.com', `password` = 'collins22', `dob` = '2000-06-03'
WHERE `users`.`id` IN ('10')
---
            ];


            $UsersModel->update($id, $data);

DELETE FROM `users`
WHERE `id` IN ('11')
---
   public function delete_user($id=0)
   {
      if ($id == 0)
      {
         return $this->respond([
            'status' => 0,
            'message' => "id missing"
         ], 400);
      }
      else
      {
         $data = $this->compile($id);

         $UsersModel = new UsersModel();

         $UsersModel->delete($id);